; domain
(define (domain dummy)
  (:requirements :strips)
  (:predicates (connected ?x ?y)
	       (at ?x)
  )

  (:action go
	     :parameters (?x ?y)
	     :precondition (and (at ?x) (connected ?x ?y))
	     :effect
	     (and (not (at ?x)) (at ?y) (not (connected ?x ?y)))

  )

)

; problem
(define (problem n-7)
(:domain dummy)
(:objects n1 r1 n2 r2 n3 r3 n4 r4 n5 r5 n6 r6 n7)
(:init
(at n1)
(connected n1 n2)
(connected n1 r1)
(connected r1 n2)
(connected n2 n3)
(connected n2 r2)
(connected r2 n3)
(connected n3 n4)
(connected n3 r3)
(connected r3 n4)
(connected n4 n5)
(connected n4 r4)
(connected r4 n5)
(connected n5 n6)
(connected n5 r5)
(connected r5 n6)
(connected n6 n7)
(connected n6 r6)
(connected r6 n7)
)
(:goal
(at n7)
)
)

; plan
1. (go n1 n2)
   deleted: (at n1) (connected n1 n2)
   added: (at n2)
   goals met: 0 of 1
2. (go n2 n3)
   deleted: (at n2) (connected n2 n3)
   added: (at n3)
   goals met: 0 of 1
3. (go n3 n4)
   deleted: (at n3) (connected n3 n4)
   added: (at n4)
   goals met: 0 of 1
4. (go n4 n5)
   deleted: (at n4) (connected n4 n5)
   added: (at n5)
   goals met: 0 of 1
5. (go n5 n6)
   deleted: (at n5) (connected n5 n6)
   added: (at n6)
   goals met: 0 of 1
6. (go n6 n7)
   deleted: (at n6) (connected n6 n7)
   added: (at n7)
   goals met: 1 of 1
